Table of Contents
 Class ResultOfNLASection
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of internal forces in the one position
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLASection
Inheritance
object
ResultOfNLASection
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfNLASection()
Constructor
public ResultOfNLASection()
Properties
 Points
Results in points
public List<ResultOfNLAPoint> Points { get; set; }
Property Value
List<ResultOfNLAPoint>
 Position
Position on member
public double Position { get; set; }
Property Value
double
 Edit this page